## DESAFIO PANDA BASICS

Tem-se os 5 datasets do ano de 2019 da maiores empresas de tecnologia do mundo, sendo elas Apple, Google, Netflix, Amazon e Tesla. Os objetivos são:

- Adicionar uma coluna com o código de cada ação
- Passar a data como dtype datatime e transformá-la em index
- Juntar todos os arquivos em um só
- Ao final, responder a pergunta: qual das 5 ações teve a maior média de fechamento no período de julho a setembro de 2019?

### Importando as bases de dados e a biblioteca pandas

In [57]:
import pandas as pd

In [5]:
apple = pd.read_csv('AAPL.csv')
amazon = pd.read_csv('AMZN.csv')
google = pd.read_csv('GOOG.csv')
netflix = pd.read_csv('NFLX.csv')
tesla = pd.read_csv('TSLA.csv')

### Transformando a coluna 'Date' em datetime

In [8]:
apple['Date'] = pd.to_datetime(apple['Date'])
amazon['Date'] = pd.to_datetime(amazon['Date'])
google['Date'] = pd.to_datetime(google['Date'])
netflix['Date'] = pd.to_datetime(netflix['Date'])
tesla['Date'] = pd.to_datetime(tesla['Date'])

### Adicionando a coluna 'Empresa' a cada DB com seu respectivo nome

In [60]:
apple['Empresa'] = 'Apple'
amazon['Empresa'] = 'Amazon'
google['Empresa'] = 'Google'
netflix['Empresa'] = 'Netflix'
tesla['Empresa'] = 'Tesla'

### Colocando a coluna 'Date' como index

In [43]:
apple.set_index(['Date'], inplace=True)
amazon.set_index(['Date'], inplace=True)
google.set_index(['Date'], inplace=True)
netflix.set_index(['Date'], inplace=True)
tesla.set_index(['Date'], inplace=True)

### Exibindo as ações de cada empresa no período de julho a setembro de 2019

In [48]:
apple.loc['2019-09-06': '2019-09-11'].groupby('Empresa').max()

,Open,High,Low,Close,Adj Close,Volume,code
Empresa,,,,,,,
Apple,218.070007,223.710007,217.729996,223.589996,222.392929,44289600,Apple

In [49]:
amazon.loc['2019-09-06': '2019-09-11'].groupby('Empresa').max()

           Open    High          Low       Close   Adj Close   Volume    code
Empresa
Amazon   1841.0  1850.0  1826.400024  1833.51001  1833.51001  2999500  Amazon

In [50]:
google.loc['2019-09-06': '2019-09-11'].groupby('Empresa').max()

,Open,High,Low,Close,Adj Close,Volume,code
Empresa,,,,,,,
Google,1208.130005,1222.599976,1202.521973,1220.170044,1220.170044,1471900,Google

In [51]:
netflix.loc['2019-09-06': '2019-09-11'].groupby('Empresa').max()

,Open,High,Low,Close,Adj Close,Volume,code
Empresa,,,,,,,
Netflix,294.809998,301.549988,290.600006,294.339996,294.339996,12320200,Netflix

In [52]:
tesla.loc['2019-09-06': '2019-09-11'].groupby('Empresa').max()

,Open,High,Low,Close,Adj Close,Volume,code
Empresa,,,,,,,
Tesla,237.380005,248.169998,236.0,247.100006,247.100006,10042800,Tesla

### Concatenando pelo método concat todas as empresas em um dataframe único a fim de realizar a pesquisa de qual teve a maior média de fechamento no período desejado

In [66]:
df_empresas = pd.concat([apple, amazon, google, netflix, tesla])
df_empresas.loc['2019-09-06': '2019-09-11'].groupby('Empresa').max()

,Open,High,Low,Close,Adj Close,Volume,code
Empresa,,,,,,,
Amazon,1841.000000,1850.000000,1826.400024,1833.510010,1833.510010,2999500,Amazon
Apple,218.070007,223.710007,217.729996,223.589996,222.392929,44289600,Apple
Google,1208.130005,1222.599976,1202.521973,1220.170044,1220.170044,1471900,Google
Netflix,294.809998,301.549988,290.600006,294.339996,294.339996,12320200,Netflix
Tesla,237.380005,248.169998,236.000000,247.100006,247.100006,10042800,Tesla

### Considerações finais

#### Por meio das abordagens realizadas, foi possível observar que a Amazon possuiu a maior média de fechamento do perído de julho a setembro de 2019